{
  "backend/main.mo": "Motoko canister storing one response per caller, with submitResponse preventing duplicates and checkResponse returning whether the caller submitted.",
  "feature_evidence.json": "Feature evidence report linking a name‑change update to the Valentine page and identifying affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend Valentine page components, styling, and backend hooks.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH color tokens, dark mode variables, and global border/background styles.",
  "frontend/index.html": "HTML entry point mounting the React app and including a build metadata comment.",
  "frontend/src/App.tsx": "Initializes React Query and renders ValentinePage after validating the current path.",
  "frontend/src/components/FloatingHearts.tsx": "Generates 20 animated floating hearts with randomized positions, delays, and sizes for background decoration.",
  "frontend/src/components/SuccessMessage.tsx": "Displays animated success screen with heart confetti, celebratory text, and personalized name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, identity loading, and status handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks calling backend methods to check and submit a Valentine's response.",
  "frontend/src/index.css": "Global Valentine-themed CSS including fonts, OKLCH variables, and custom animations for hearts, confetti, and UI micro‑interactions.",
  "frontend/src/lib/shareSlug.ts": "Defines the canonical Valentine slug and helpers for validating paths and generating share URLs.",
  "frontend/src/main.tsx": "App entry point wiring InternetIdentityProvider and React Query before rendering App.",
  "frontend/src/pages/ValentinePage.tsx": "Interactive Valentine page with playful yes/no button behavior, animated no-button responses, name constant, and share/response handling logic.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, radii, shadows, and plugins including Valentine theme colors.",
  "project_state.json": "Metadata describing project features, requirements, and current state for an interactive Valentine page."
}