{
  "backend/main.mo": "Motoko actor storing one text response per principal with functions to submit and check responses.",
  "feature_evidence.json": "Feature evidence file listing two Valentine URL slug features with associated frontend files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, hooks, styles, and slug utilities.",
  "frontend/index.css": "Tailwind base theme defining color variables for light/dark modes and applying background/foreground styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Root React component initializing React Query and rendering ValentinePage after path validation.",
  "frontend/src/components/FloatingHearts.tsx": "Generates and animates 20 floating heart icons with randomized positions and timings.",
  "frontend/src/components/SuccessMessage.tsx": "Displays a celebratory success screen with confetti hearts, animations, and personalized text.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for checking if a response exists and submitting a new response to the backend.",
  "frontend/src/index.css": "Global Tailwind styles, Valentine color palette, fonts, and animation definitions including hearts and button effects.",
  "frontend/src/lib/shareSlug.ts": "Defines the canonical slug 'mujhe-to-tu-psnd-hai' and functions for validating Valentine paths and generating share URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/pages/ValentinePage.tsx": "Implements the interactive Valentine page with playful No-button behavior, animations, rotating excuse texts, response submission, and share/copy logic.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and Valentine-themed styles.",
  "project_state.json": "Stores project metadata, feature definitions, and pending requests related to the playful No button and custom share URL."
}